# Taps

# --- Terminal & Shell ---
cask "ghostty"
brew "tmux"
brew "fzf"
brew "neovim"

# --- Dev Tools ---
brew "git"
brew "gh"
brew "jq"
brew "ripgrep"
brew "fd"
brew "tree"
brew "k9s"

# --- Languages & Runtimes ---
brew "node"
brew "python"
brew "ruby"
brew "openssl@3"

# --- Containers & K8s ---
cask "podman-desktop"
brew "kubectl"
brew "kind"
brew "helm"

# --- Apps ---
cask "rectangle"
cask "1password"
cask "1password-cli"

# --- tmux ---
brew "tpm"

# --- SSH ---
brew "sshpass"

# --- Add more below ---
